# Ejemplo Practico para Pandas con DataFrames

## 1. Inspeccion Inicial del DataFrame

In [68]:
# Importacion de Librerias
import pandas as pd

In [69]:
# Crear un DataFrame a partir de un Diccionario
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Lucia', 'Marta', 'Jorge', 'Sofia'],
    'Edad':[23,35,45,25,30,28,32],
    'Ciudad':['CDMX','Guadalajara','Monterry','CDMX','Puebla','CDMX','Guadalajara'],
    'Salario':[12000,15000,18000,12500,14000,13000,15500],
    'Departamento':['Ventas','Marketing','Ventas','TI','TI','Marketing','Ventas']
}

In [70]:
df = pd.DataFrame(data)
df

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
1    Luis    35  Guadalajara    15000    Marketing
2  Carlos    45     Monterry    18000       Ventas
3   Lucia    25         CDMX    12500           TI
4   Marta    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas

## 2. Estructua del DataFrame

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [72]:
df.describe()

            Edad       Salario
count   7.000000      7.000000
mean   31.142857  14285.714286
std     7.335498   2078.804602
min    23.000000  12000.000000
25%    26.500000  12750.000000
50%    30.000000  14000.000000
75%    33.500000  15250.000000
max    45.000000  18000.000000

In [73]:
# Muestra el tamaño del DataFrame
# (FILAS, COLUMNAS)
df.shape

(7, 5)

In [74]:
# Numero de filas
df.shape[0]

7

In [75]:
# Numero de columnas
df.shape[1]

5

In [76]:
# Muestra los tipos de datos de la columnas
df.dtypes

Nombre          object
Edad             int64
Ciudad          object
Salario          int64
Departamento    object
dtype: object

In [77]:
# Muestra el nombre de las columnas que tiene
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Salario', 'Departamento'], dtype='object')

In [78]:
# Muestra los indices que tiene
df.index

RangeIndex(start=0, stop=7, step=1)

## 3. Seleccion de Columnas y Filas
### Llamado segmentacion

In [79]:
# Selecciona una sola columna del DataFrame como una sola fila
df['Edad']

0    23
1    35
2    45
3    25
4    30
5    28
6    32
Name: Edad, dtype: int64

In [80]:
# Muestra el tipo de dato
type(df['Edad'])

pandas.core.series.Series

In [81]:
# Se muestra una lista como un DataFrame
df[['Edad']]

   Edad
0    23
1    35
2    45
3    25
4    30
5    28
6    32

In [82]:
# Visualizar dos columnas
df[['Nombre','Salario']]

   Nombre  Salario
0     Ana    12000
1    Luis    15000
2  Carlos    18000
3   Lucia    12500
4   Marta    14000
5   Jorge    13000
6   Sofia    15500

In [83]:
df[['Nombre','Salario','Departamento']]

   Nombre  Salario Departamento
0     Ana    12000       Ventas
1    Luis    15000    Marketing
2  Carlos    18000       Ventas
3   Lucia    12500           TI
4   Marta    14000           TI
5   Jorge    13000    Marketing
6   Sofia    15500       Ventas

## 4. Filtrado de Filas

In [84]:
# Filtrar todas las filas que la ciudad sea CDMX
df[df['Ciudad'] == 'CDMX']

  Nombre  Edad Ciudad  Salario Departamento
0    Ana    23   CDMX    12000       Ventas
3  Lucia    25   CDMX    12500           TI
5  Jorge    28   CDMX    13000    Marketing

In [85]:
df[df['Ciudad'] == 'CDMX'][['Nombre','Ciudad','Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

In [86]:
df_cdmx = df[df['Ciudad'] == 'CDMX']

In [87]:
df_cdmx[['Nombre','Ciudad','Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

In [88]:
# Mostrar todos los filtros de la ciudad de México y del departamento de TI
# df['Ciudad'] = 'CDMX'
df[(df['Ciudad'] == 'CDMX') & ((df['Departamento'] == 'TI'))]

  Nombre  Edad Ciudad  Salario Departamento
3  Lucia    25   CDMX    12500           TI

## Ejemplo
### Mostrar todas las filas de la ciudad e México o del departamento de TI

In [89]:
df[(df['Ciudad'] == 'CDMX') | ((df['Departamento'] == 'TI'))]

  Nombre  Edad  Ciudad  Salario Departamento
0    Ana    23    CDMX    12000       Ventas
3  Lucia    25    CDMX    12500           TI
4  Marta    30  Puebla    14000           TI
5  Jorge    28    CDMX    13000    Marketing

## 5. Ordenar Filas

In [90]:
# Ordena por el salario de forma ascendente
# Siempre se van a ordenar de forma ascendente aunque no lo pongas
df.sort_values(by='Salario', ascending=True)

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marketing
4   Marta    30       Puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45     Monterry    18000       Ventas

In [91]:
# Ordena por el salario de forma descendente
df.sort_values(by='Salario', ascending=False)

   Nombre  Edad       Ciudad  Salario Departamento
2  Carlos    45     Monterry    18000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
4   Marta    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

In [92]:
# Ordenar por el salario y la ciudad
df.sort_values(by=['Salario','Ciudad'])

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marketing
4   Marta    30       Puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45     Monterry    18000       Ventas

In [93]:
# Ordenar por el salario ascendente y la ciudad descendente
df.sort_values(by=['Salario','Ciudad'], ascending=[True,False])

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marketing
4   Marta    30       Puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45     Monterry    18000       Ventas

In [94]:
# Ordenar por el salario descendente y la ciudad ascendente
df.sort_values(by=['Salario','Ciudad'], ascending=[False,True])

   Nombre  Edad       Ciudad  Salario Departamento
2  Carlos    45     Monterry    18000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
4   Marta    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

In [95]:
df[(df['Ciudad'] == 'CDMX') | ((df['Departamento'] == 'TI'))].sort_values(by=['Edad','Departamento'],ascending=[True,False])

  Nombre  Edad  Ciudad  Salario Departamento
0    Ana    23    CDMX    12000       Ventas
3  Lucia    25    CDMX    12500           TI
5  Jorge    28    CDMX    13000    Marketing
4  Marta    30  Puebla    14000           TI

# 6. Crear Nuevas Columnas

In [96]:
df['SalarioAnual'] = df['Salario'] * 12

In [97]:
df

   Nombre  Edad       Ciudad  Salario Departamento  SalarioAnual
0     Ana    23         CDMX    12000       Ventas        144000
1    Luis    35  Guadalajara    15000    Marketing        180000
2  Carlos    45     Monterry    18000       Ventas        216000
3   Lucia    25         CDMX    12500           TI        150000
4   Marta    30       Puebla    14000           TI        168000
5   Jorge    28         CDMX    13000    Marketing        156000
6   Sofia    32  Guadalajara    15500       Ventas        186000